#+title: Literate Emacs Configuration
#+author: tiyano
#+latex_class: doc
#+options: h:6

** Actually using this stuff

Now, after loading our package management tools, we can actually load
our config. This also includes tangling/byte-compiling this file if
it is out of date.x
   
First, define a function that checks if all provided files are newer
than this config.

#+name: file-age-helper-function
#+begin_src emacs-lisp
  (defun tiyano/check-if-newer-than-conf (files &optional dir)
    "Compares the mtimes of every passed file and the configuration"
    (or dir (setq dir (expand-file-name "lisp" user-emacs-directory)))
    (or (mapcar #'(lambda (file)
                    (file-newer-than-file-p
                     (expand-file-name file dir)
                     (expand-file-name "conf.org" dir)))
                files)))
#+end_src

A list containing the names of our tangeled files would also be helpful.   
   
#+name: config-file-list
#+begin_src emacs-lisp
  (defvar tiyano/config-file-list '("editor"
                                    "interface"
                                    "toolkit"
                                    "visuals"
                                    "de"))

  (defvar tiyano/config-file-list-with-extensions (mapcar
                                                   #'(lambda (s)
                                                       (concat s ".el"))
                                                   tiyano/config-file-list))
#+end_src

#+RESULTS: config-file-list
: tiyano/config-file-list-with-extensions

Now, tangle all our config files if they are out of
date.

#+name: tangle-old-files
#+begin_src emacs-lisp
  (let ((gc-cons-threshold most-positive-fixnum))
    (use-package org
      :demand
      :straight (:type built-in)
      :mode ("\\.org" . org-mode))
    ;;(if (not (tiyano/check-if-newer-than-conf tiyano/config-file-list user-emacs-directory))
    (org-babel-tangle-file (expand-file-name "conf.org" user-emacs-directory)))
#+end_src

#+RESULTS: tangle-old-files
| /home/val/.config/emacs/init.el | /home/val/.config/emacs/lisp/de.el | /home/val/.config/emacs/lisp/visuals.el | /home/val/.config/emacs/lisp/toolkit.el | /home/val/.config/emacs/lisp/interface.el | /home/val/.config/emacs/lisp/editor.el | /home/val/.config/emacs/lisp/init.el |

Lastly, load the files.

#+name: load-config-files
#+begin_src emacs-lisp
  (let ((gc-cons-threshold most-positive-fixnum))
    (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
    (mapc 'load tiyano/config-file-list))
#+end_src

#+RESULTS: load-config-files
| editor | interface | toolkit | visuals | de |

*** Latex
#+name: auctex
#+begin_src emacs-lisp
  (use-package tex
    :straight auctex
    :custom ((TeX-auto-save t)
             (TeX-parse-self t)
             (TeX-master nil)
             (reftex-plug-into-AUCTeX)
             (TeX-PDF-mode t)
             (TeX-view-program-selection '((output-pdf "PDF Tools")))
             (TeX-source-correlate-start-server t))
    :hook ((LaTeX-mode LaTeX-math-mode)
           (LaTeX-mode turn-on-reftex)
           ('TeX-after-compilation-finished-functions
            #'TeX-revert-document-buffer )))
#+end_src

#+RESULTS: auctex
| TeX-after-compilation-finished-functions |

#+begin_src emacs-lisp
  (use-package bibtex
    :custom
    (bibtex-dialect 'biblatex)
    :config
    (bibtex-set-dialect 'biblatex))
#+end_src

#+RESULTS:
: t

** Syntax Highlighting

I use ~tree-sitter~ for better syntax highlighting, which uses syntax trees instead of regexps.

#+begin_src emacs-lisp
      (use-package tree-sitter
        :config
        (use-package tree-sitter-langs)
        (global-tree-sitter-mode 1)
        :hook (tree-sitter-after-on . tree-sitter-hl-mode))
#+end_src

#+RESULTS:
| tree-sitter-hl-mode |

** Cleanup

Emacs comes with default settings that I dont really enjoy.

I dont need mouse-based interaction, and I set emacs to save stuff
between sessions (and also save files when I close it).

#+name: declutter-interface
#+begin_src emacs-lisp
  (use-package emacs
    :custom ((inhibit-startup-message t)
             (inhibit-splash-screen t)
             (x-gtk-use-system-tooltips nil)
             (use-dialog-box nil)
             (ring-bell-function 'ignore))
    :config
    (scroll-bar-mode -1)
    (tool-bar-mode 0)
    (tooltip-mode 0)
    (menu-bar-mode 0))
#+end_src

#+RESULTS: declutter-interface
: t

#+name: simplify-interface
#+begin_src emacs-lisp
  (use-package emacs
    :custom ((confirm-kill-processes nil)
             (global-auto-revert-non-file-buffers t)
             (auto-revert-verbose nil)
             (undo-tree-auto-save-history t)
             (undo-tree-history-directory-alist
              ((".*" . (concat user-emacs-directory "undo/")))))

    :hook ((delete-frame-functions save-some-buffers))
    :config
    (defalias 'yes-or-no-p 'y-or-n-p)
    (global-auto-revert-mode t))
#+end_src

#+RESULTS: simplify-interface
| emacs |

***** A different essay class
Another class I need to use for assignments.

#+name: latex-frrr
#+begin_src emacs-lisp
  (use-package org
    :straight (:type built-in)
    :config (with-eval-after-load 'ox-latex
              (add-to-list 'org-latex-classes
                           '("frrr"
                             "\\documentclass{article}
        \\usepackage{helvet}
        \\renewcommand{\\familydefault}{\\sfdefault}
        \\usepackage{booktabs}
        \\usepackage[margin=2cm]{geometry}
        \\usepackage{parskip}
        \\linespread{2}
        \\usepackage[AUTO]{babel}
        \\usepackage[hidelinks]{hyperref}
        \\usepackage{xcolor}
        \\usepackage{fancyhdr}
        \\pagestyle{fancy}
        \\fancyhf{}"
                             ("\\section{%s}" . "\\section{%s}")
                             ("\\subsection{%s}" . "\\subsection{%s}")
                             ("\\subsubsection{%s}" . "\\subsubsection{%s}")
                             ("\\paragraph{%s}" . "\\paragraph{%s}")
                             ("\\subparagraph{%s}" . "\\subparagraph{%s}")))))
#+end_src

#+RESULTS: latex-frrr
| frrr | \documentclass{article} |

** Window Manager

You probably know the joke about emacs being a great OS - this is a
good step towards it. It is only started when the proper environment
variable is set.

#+name: window-manager
#+begin_src emacs-lisp
          (use-package exwm
            :init
            (require 'exwm-systemtray)
            (exwm-systemtray-enable)

            (use-package exwm-edit)

            (use-package cannon
              :straight (:host github :repo "lambdart/cannon"))

            (use-package gpastel
              :hook (gpastel-mode . exwm-init-hook))

            (defun start-applets ()
              "Start a few applets, like nm-applet"
              (start-process-shell-command
               "Network Manager Applet" nil "nm-applet")
              (start-process-shell-command
               "PulseAudio Applet" nil "pasystray")
              (start-process-shell-command
               "Blueman Applet" nil "blueman-applet")
              (start-process-shell-command
               "lemonbar" nil "~/.config/lemonbar/bar.sh | lemonbar -g x36 -f \"IBM Plex Mono Semibold\" -f \"Symbols Nerd Font\" -F \"#ebdbb2\" -B \"#282828\" -u 4 -U \"#b16286\" &")
              (start-process-shell-command
               "dunst" nil "dunst")
              (start-process-shell-command
               "gpaste" nil "gpaste-client start"))

            (defun tiyano/kill-x-buffer ()
              "Kill current buffer and its associated window if its an X buffer"
              (interactive)
              (if (eq major-mode "exwm-mode") ;; is x buffer
                  ((kill-this-buffer) ;; kill this buffer and close window
                   (delete-window))
                (message "Not an X buffer")))

            (start-applets)

            :hook
            (exwm-update-class . (lambda () (exwm-workspace-rename-buffer exwm-class-name)))

            :custom
            (exwm-layout-show-all-buffers t)
            (exwm-workspace-show-all-buffers t)
            (exwm-input-global-keys
             `(([?\s-W] . exwm-workspace-switch)
               ([?\s-c] . tiyano/kill-x-buffer)
               ([s-return] . multi-vterm)
               ([s-tab] . vterm)
               ([?\s-e] . dired-jump)
               ([?\s-T] . exwm-reset)
               ([?\s-f] . exwm-layout-toggle-fullscreen)
               ([?\s- ] . cannon-launch)
               ([?\s-0] . (lambda () (interactive) (exwm-workspace-switch-create 0)))
               ([?\s-1] . (lambda () (interactive) (exwm-workspace-switch-create 1)))
               ([?\s-2] . (lambda () (interactive) (exwm-workspace-switch-create 2)))
               ([?\s-3] . (lambda () (interactive) (exwm-workspace-switch-create 3)))
               ([?\s-4] . (lambda () (interactive) (exwm-workspace-switch-create 4)))
               ([?\s-5] . (lambda () (interactive) (exwm-workspace-switch-create 5)))
               ([?\s-6] . (lambda () (interactive) (exwm-workspace-switch-create 6)))
               ([?\s-7] . (lambda () (interactive) (exwm-workspace-switch-create 7)))
               ([?\s-8] . (lambda () (interactive) (exwm-workspace-switch-create 8)))
               ([?\s-9] . (lambda () (interactive) (exwm-workspace-switch-create 9)))
               ([s-right] . windmove-right)
               ([s-left] . windmove-left)
               ([s-up] . windmove-up)
               ([s-down] . windmove-down)))
            (exwm-input-simulation-keys
             '(([?\C-w] . [?\C-x])
               ([?\M-w] . [?\C-c])
               ([?\C-y] . [?\C-v])
               ([?\C-b] . [left])
               ([?\C-f] . [right])
               ([?\C-p] . [up])
               ([?\C-n] . [down])
               ([?\C-a] . [home])
               ([?\C-e] . [end])
               ([?\M-v] . [prior])
               ([?\C-v] . [next])
               ([?\C-d] . [delete])
               ([?\C-k] . [S-end delete])
               ([?\C-s] . [?\C-f])))
            :config (exwm-enable))
#+end_src

#+RESULTS: window-manager
| lambda  | nil | (exwm-workspace-rename-buffer exwm-class-name) |                                                |
| closure | (t) | nil                                            | (exwm-workspace-rename-buffer exwm-class-name) |
